[
    {
        "id": 1,
        "titulo": "Organo: gestão de equipes",
        "texto": "Desenvolvido durante meus estudos, o projeto me permitiu aprofundar os conhecimentos sobre React.js, componentes e o uso de seus Hooks.\n## Teste a versão completa [aqui](https://organo-three-green.vercel.app/)\n ## [Repositório do projeto](https://github.com/LuizEsb/Organo)\n### [Linkedin](https://www.linkedin.com/in/luiz-felipe-esboldrim-9942a0345/)"
    },
    {
        "id": 2,
        "titulo": "ERP em Delphi + Firebird",
        "texto": "Fiz este projeto durante meu período de Desenvolvedor Delphi Trainee, me auxiliou não só a compreender o funcionamento de bancos de dados e como manipulá-los, como também a aplicar algumas práticas de código limpo. Contém um sistema comercial modular que facilita a manutenção e escalabilidade com foco na segurança dos dados.\n## [Repositório do projeto](https://github.com/LuizEsb/ERP-Delphi)\n### [Linkedin](https://www.linkedin.com/in/luizesb)"
    },
    {
        "id": 3,
        "titulo": "CodeConnect: rede social",
        "texto": "Durante meus estudos sobre React (componentes, Hooks e JSX), desenvolvi este projeto de uma rede social fictícia para pessoas desenvolvedoras chamada CodeConnect.\n## Teste o projeto [aqui](https://code-connect-nine-rose.vercel.app/)\n## Confira a página de feed [aqui](https://github.com/LuizEsb/CodeConnect-feed)\n## [Repositório do projeto](https://github.com/LuizEsb/CodeConnect)\n### [Linkedin](https://www.linkedin.com/in/luiz-felipe-esboldrim-9942a0345/)"
    },
    {
        "id": 4,
        "titulo": "AluraBooks: biblioteca virtual",
        "texto": "Este projeto web contém uma interface de um site fictício 'AluraBooks' feito por mim durante meus estudos com foco na prática da aplicação de responsividade. O site possui display responsivo e foi desenvolvido no método mobile-first. \n ## Confira a versão completa [aqui](https://web-alurabooks-olive.vercel.app/) \n## [Repositório do projeto](https://github.com/LuizEsb/alurabooks-responsive)\n ### [Linkedin](https://www.linkedin.com/in/luiz-felipe-esboldrim-9942a0345/)"
    },
    {
        "id": 5,
        "titulo": "Memoteca: mural de pensamentos",
        "texto": "Memoteca é um aplicativo organizador de pensamentos e frases que permite cadastrar, listar, editar e deletar pensamentos, incluindo informações como conteúdo e autoria. Desenvolvi esse projeto durante meus estudos e me auxiliou a praticar implementações CRUD com requisições HTTP.\n## 🛠️ Abrir e rodar o projeto\n## [Repositório do projeto](https://github.com/LuizEsb/Memoteca)\nPara executar a API fake, você vai precisar do NodeJS; a versão utilizada foi a 22.17.0.\n\nInstale o JSON Server globalmente (se ainda não estiver instalado):\n\n```bash\nnpm install -g json-server\n```\n\nPara simular o backend, abra um novo terminal e acesse a pasta backend:\n\n```bash\ncd backend\n```\n\nEntão, inicie a API fake com:\n\n```bash\nnpm start\n```\n\nAcesse o backend localmente em seu navegador:\n\nhttp://localhost:3000\n\nPara executar o frontend, abra o projeto no Visual Studio Code. Com a extensão Live Server instalada, clique com o botão direito no arquivo index.html e selecione \"Open with Live Server\" no menu de contexto.\nAcesse o frontend localmente em seu navegador:\n\nhttp://localhost:5500\n### [Linkedin](https://www.linkedin.com/in/luiz-felipe-esboldrim-9942a0345/)"
    },
    {
        "id": 6,
        "titulo": "Fokus: timer pomodoro",
        "texto": "A página contém timers ideais para o método de estudo Pomodoro, com 25 minutos no modo foco, 5 minutos de pausa curta e 15 minutos de pausa longa. Possui uma lista de tarefas, alertas sonoros, além da opção de ativar uma música calma e relaxante. Desenvolvi esse projeto durante meus estudos e com ele aprendi bastante sobre manipulação do DOM, eventos, implementação de áudios, manipulação de datas e contadores com intervalos, além de praticar a estruturação dinâmica e estilização de páginas web com HTML e CSS.\n\n## Confira a versão completa [aqui](https://fokus-five-neon.vercel.app/)\n## [Repositório do projeto](https://github.com/LuizEsb/Fokus)\n### [Linkedin](https://www.linkedin.com/in/luizesb)"
    },
    {
        "id": 7,
        "titulo": "VidFlow: plataforma de vídeos",
        "texto": "O VidFlow é uma plataforma de compartilhamento de vídeos. Projeto desenvolvido durante meus estudos com foco na manipulação de pacotes com Node. Interface e design previamente fornecida pela disponibilizadora do curso.\n \n## Teste o projeto [aqui](https://vid-flow-beta.vercel.app/)\n## [Repositório do projeto](https://github.com/LuizEsb/VidFlow)\n\n### [Linkedin](https://www.linkedin.com/in/luiz-felipe-esboldrim-9942a0345/)"
    },
    {
        "id": 8,
        "titulo": "OptimusTech: website empresarial",
        "texto": "Este projeto contém um website empresarial fictício \"OptimusTech\" desenvolvido por mim. O site ainda não possui responsividade pois foi desenvolvido no método desktop-first.\n\n### Confira o projeto completo [aqui](https://optimus-tech-umber-three.vercel.app/) \n ## [Repositório do projeto](https://github.com/LuizEsb/optimus-tech)\n### [Linkedin](https://www.linkedin.com/in/luiz-felipe-esboldrim-9942a0345/)"
    }
]