[
    {
        "id": 1,
        "titulo": "Organo: gestão de equipes",
        "texto": "# Organo\n\nA Organo é uma aplicação de gestão de equipes que permite registrar colaboradores e organizá-los por times. Cada time possui um estilo característico, customizável dinamicamente através de props e elevação de dependências dos componentes.\n\n## Teste a versão completa [aqui](https://organo-three-green.vercel.app/)\n\n## Cards dos Times\nÉ possível favoritar os colaboradores ou removê-los do time clickando no X acima dele.\n\n![Design card times](https://i.imgur.com/lqMudnj.png)\n\nVocê também pode alterar as cores dos times em tempo real! E tudo isso só é possível, de maneira simples, graças ao virtual DOM e aos estados do React!\n\n![Mudando cor card times](https://i.imgur.com/mlwOGBe.png)\n\nOs times são removidos automaticamente quando não houverem mais colaboradores os compondo.\n\n## Página inicial\n\n![Tela inicial organo](https://i.imgur.com/xtW2lnu.png)\n\n## Tela de cadastro\nA aplicação conta com dois formulários. Um de cadastro de colaboradores, com nome, cargo, url da imagem do colaborador e time a que pertence. Já o de cadastro de times conta com um campo para o nome do time e uma seleção da cor característica do time.\n\n![Formulário de cadastro de colaborador](https://i.imgur.com/tlO6g5v.png)\n\n## [Repositório do projeto](https://github.com/LuizEsb/Organo)\n## Como rodar o projeto:\n\nCertifique-se de que você tenha o Node e o json-server instalado,\n\nAbra a pasta do projeto na sua IDE,\n\nRode o projeto localmente com este comando no terminal:\n\n```bash\nnpm start\n```\nO projeto deve abrir automaticamente no seu navegador padrão.\n\nCaso não abra, com Ctrl + clique acesse o link que o terminal exibir (algo parecido com \"http://localhost:3000\")\n\n### Ferramentas utilizadas:\n\n* React.js\n* Node.js\n* HTML\n* CSS\n* Vite\n* Bibliotecas como react-icons e hex-to-rgba\n\n> Desenvolvido durante meus estudos, o projeto me permitiu aprofundar os conhecimentos sobre React.js, componentes e o uso de seus Hooks.\n\n## Feito por:\n\n### LuizEsb\n\n### [Linkedin](https://www.linkedin.com/in/luiz-felipe-esboldrim-9942a0345/)" 

    },
    {
        "id": 2,
        "titulo": "ERP em Delphi + Firebird",
        "texto": "# ERP em Delphi + Firebird\n\nFiz este projeto durante meu período de Desenvolvedor Delphi Trainee, me auxiliou não só a compreender o funcionamento de bancos de dados e como manipulá-los, como também a aplicar algumas práticas de código limpo. Contém um sistema comercial modular que facilita a manutenção e escalabilidade com foco na segurança dos dados.\n\n![Design da tela de clientes ERP-Delphi](https://i.imgur.com/g9NB4FK.png)\n\n## 🛠️Funcionalidades\n\n* Login com criptografia de senha SHA-256\n\n* Cadastro de Clientes e Produtos\n\n* Pesquisa e filtragem de Clientes por ID ou Nome (Login) \n\n* Controle de estoque (em desenvolvimento)\n\n* Interface por Cards com navegação embutida (formulários carregados em painéis)\n\n* Layout responsivo com organização por painel lateral fixo e conteúdo dinâmico\n\n* Expiração de sessão com timer\n\n## ✔️Tecnologias utilizadas:\n\n* Delphi 11\n* Firebird 2.5.9\n* FireDAC\n\n## [Repositório do projeto](https://github.com/LuizEsb/ERP-Delphi)\n## Feito por:\n\n### LuizEsb\n\n### [Linkedin](https://www.linkedin.com/in/luizesb)" 

    },
    {
        "id": 3,
        "titulo": "CodeConnect: rede social",
        "texto": "# CodeConnect\n\nDurante meus estudos sobre React (componentes, Hooks e JSX), desenvolvi este projeto de uma rede social fictícia para pessoas desenvolvedoras chamada CodeConnect.\n\n![imagem tela de login codeConnect](https://i.imgur.com/9pkuf9E.png)\n\n## Teste o projeto [aqui](https://code-connect-nine-rose.vercel.app/)\n\n## Confira a página de feed [aqui](https://github.com/LuizEsb/CodeConnect-feed)\n\n## 🔨 Funcionalidades do projeto\n\n Página de login da CodeConnect, contendo uma imagem, um formulário de e-mail e senha com títulos e textos, um botão para entrar na aplicação, links para lembrar senha ou cadastrar. \n Após o login (API de usuários não implementada), o usuário tem acesso à página de upload de imagens da rede social. \n Na página de uploads o usuário pode carregar uma imagem e ter um preview da mesma clicando no botão \"Carregar imagem\" ou no \"Publicar\" do menu lateral.\n Ao clicar no botão \"Sair\", o usuário é redirecionado para a página de login.\n\n ![imagem tela de upload](https://i.imgur.com/Gr3OQzz.png)\n\n## ✔️ Técnicas e tecnologias utilizadas\n\nAs técnicas e tecnologias utilizadas pra isso são:\n\n- `JavaScript`: Linguagem de programação principal do projeto.\n- `React`: Biblioteca JavaScript para construção de interfaces de usuário. Utilizada para desenvolver a página de login.\n- `React-DOM`: Pacote que permite a integração do React com a árvore de elementos do DOM.\n- `Babel`: Transpilador que converte código JavaScript moderno em versões compatíveis com navegadores mais antigos, além de permitir a interpretação de códigos JSX.\n- `JSX`: Uma extensão de sintaxe para JavaScript usada no React, que permite a escrita de código HTML/XML de forma declarativa e integrada dentro do JavaScript.\n- `Componentização`: Abordagem de design em que a interface de usuário é dividida em componentes reutilizáveis e independentes.\n- `Props`: Dados passados de um componente pai para um componente filho no React.\n- `useState`: Hook no React que permite adicionar estado a componentes funcionais.\n- `Manipulação de eventos`: Ação de responder a interações do usuário, como cliques e teclas pressionadas, em aplicações web.\n- `Eventos assíncronos`: Funções que aguardam uma resposta dinâmica. Usados para conferir o tipo de arquivo que está sendo enviado, ler o conteúdo do arquivo, verificar se a tag da postagem existe e \"publicar\" o arquivo. \n\n## 🎨 Figma\n\nVocê pode conferir o Figma da aplicação clicando [aqui](https://www.figma.com/file/SASyBm2k3IlqrO8qI1Otg1/CodeConnect-%7C-React%3A-Componentização-e-conceitos-básicos-(JSX)).\n\n## 🛠️ Abrir e rodar o projeto\n## [Repositório do projeto](https://github.com/LuizEsb/CodeConnect)\nApós baixar o projeto, você pode abrir com o Visual Studio Code. Para isso, na tela inicial da aplicação, vá em File / Arquivos e:\n\n- **Open Folder** (ou alguma opção similar)\n- Procure o local onde o projeto está e o selecione (Caso o projeto seja baixado via zip, é necessário extraí-lo antes de procurá-lo)\n- Por fim clique em OK\n\nVocê pode abrir diretamente o arquivo index.html no seu navegador ou usar uma extensão como o ``Live Server``.\n\n## Feito por:\n\n### LuizEsb\n\n### [Linkedin](https://www.linkedin.com/in/luiz-felipe-esboldrim-9942a0345/)" 

    },
    {
        "id": 4,
        "titulo": "AluraBooks: biblioteca virtual",
        "texto": " # Página Web de Biblioteca \n Este projeto web contém uma interface de um site fictício 'AluraBooks' feito por mim durante meus estudos com foco na prática da aplicação de responsividade. O site possui display responsivo e foi desenvolvido no método mobile-first. \n ## Confira a versão completa [aqui](https://web-alurabooks-olive.vercel.app/) \n ## Versão Desktop \n ![Design da tela de clientes ERP-Delphi](https://i.imgur.com/UgD5rIX.png) \n ## Menu dropdown\n ![Design da tela de clientes ERP-Delphi](https://i.imgur.com/QttepCg.png) \n ## Versão Mobile \n ![Design da tela de clientes ERP-Delphi](https://i.imgur.com/OR15xTH.png) \n ### Ferramentas utilizadas:\n * HTML\n * CSS \n## [Repositório do projeto](https://github.com/LuizEsb/alurabooks-responsive)\n ## Feito por:\n ### LuizEsb \n### [Linkedin](https://www.linkedin.com/in/luiz-felipe-esboldrim-9942a0345/) \n\n"
    },
    {
        "id": 5,
        "titulo": "Memoteca: mural de pensamentos",
        "texto": "# Memoteca\n\nMemoteca é um aplicativo organizador de pensamentos e frases que permite cadastrar, listar, editar e deletar pensamentos, incluindo informações como conteúdo e autoria. Desenvolvi esse projeto durante meus estudos e me auxiliou a praticar implementações CRUD com requisições HTTP.\n\n![imagem banner memoteca](https://i.imgur.com/w3Jn3Hq.png)\n\n## 🔨 Funcionalidades do projeto\n\n`Cadastro de pensamentos`: Permite adicionar novos pensamentos à lista, inserindo informações como conteúdo e autoria.\n\n![imagem formulário de cadastro de pensamento](https://i.imgur.com/1fmKwFq.png)\n\n`Listagem de pensamentos`: Exibe os pensamentos cadastrados, permitindo visualizar o texto e a autoria.\n\n`Pesquisa de pensamentos`: Barra de pesquisa typeahead que facilita a busca dinâmica por pensamentos já registrados.\n\n`Favoritar pensamentos`: É possível favoritar os pensamentos que você mais gostou!\n\n`Edição de pensamentos`: Permite editar pensamentos existentes, atualizando as informações conforme necessário.\n\n`Exclusão de pensamentos`: Permite remover pensamentos da lista.\n\n![imagem mural, barra de pesquisa e pensamentos](https://i.imgur.com/ZXp25k1.png)\n\n## ✔️ Técnicas e tecnologias utilizadas\n\n`JavaScript`: Linguagem de programação utilizada para desenvolver a lógica do aplicativo.\n\n`EcmaScript 6+`: Especificação da linguagem de script utilizada nos métodos de pesquisa.\n\n`Fetch API`: Utilizada para realizar requisições HTTP para comunicação com o servidor.\n\n`Axios`: Biblioteca usada para facilitar e simplificar as requisições HTTP.\n\n`Node.js`: Plataforma utilizada para executar o ambiente de desenvolvimento.\n\n`JSON Server`: Utilizado para simular um backend e facilitar o desenvolvimento e teste das operações CRUD.\n\n`CSS`: Utilizado para estilização da interface do aplicativo.\n\n## 📁 Link do Figma\n\nVocê pode [acessar o figma do projeto aqui](https://www.figma.com/design/Sz1gmmemxqcB3amInL4Ndp/Rebrand-Memoteca-%7C-Curso-CRUD?node-id=148-26&t=FpdmfbiM1i1s6REQ-0).\n\n## 🛠️ Abrir e rodar o projeto\n## [Repositório do projeto](https://github.com/LuizEsb/Memoteca)\nPara executar a API fake, você vai precisar do NodeJS; a versão utilizada foi a 22.17.0.\n\nInstale o JSON Server globalmente (se ainda não estiver instalado):\n\n```bash\nnpm install -g json-server\n```\n\nPara simular o backend, abra um novo terminal e acesse a pasta backend:\n\n```bash\ncd backend\n```\n\nEntão, inicie a API fake com:\n\n```bash\nnpm start\n```\n\nAcesse o backend localmente em seu navegador:\n\nhttp://localhost:3000\n\nPara executar o frontend, abra o projeto no Visual Studio Code. Com a extensão Live Server instalada, clique com o botão direito no arquivo index.html e selecione \"Open with Live Server\" no menu de contexto.\nAcesse o frontend localmente em seu navegador:\n\nhttp://localhost:5500\n\n## Feito por:\n\n### LuizEsb\n\n### [Linkedin](https://www.linkedin.com/in/luiz-felipe-esboldrim-9942a0345/)"
    },
    {
        "id": 6,
        "titulo": "Fokus: timer pomodoro",
        "texto": "# Timer Pomodoro\n\n A página contém timers ideais para o método de estudo Pomodoro, com 25 minutos no modo foco, 5 minutos de pausa curta e 15 minutos de pausa longa. Possui uma lista de tarefas, alertas sonoros, além da opção de ativar uma música calma e relaxante. Desenvolvi esse projeto durante meus estudos e com ele aprendi bastante sobre manipulação do DOM, eventos, implementação de áudios, manipulação de datas e contadores com intervalos, além de praticar a estruturação dinâmica e estilização de páginas web com HTML e CSS.\n\n## Confira a versão completa [aqui](https://fokus-five-neon.vercel.app/)\n\n## Modo Foco\n\n![Design Modo Foco](https://i.imgur.com/movEBG0.png)\n\n## Descanso Curto\n\n![Design Descanso Curto](https://i.imgur.com/llY1CAx.png)\n\n## Descanso Longo\n\n![Design Descanso Longo](https://i.imgur.com/s8CAxqr.png)\n\n## Funcionalidades\n\n* Timer com Modo Foco, Descanso Curto e Descanso Longo\n\n* Música relaxante (On/Off)\n\n* Alertas sonoros que indicam que o timer foi iniciado, pausado ou que chegou ao fim\n\n* Lista de tarefas que armazena dados no LocalStorage para recuperar as tarefas, tornando a experiência do usuário contínua, mesmo após recarregar ou fechar a página\n\n* Conclusão automática da tarefa em andamento após o fim do Modo Foco\n\n* Layout responsivo e conteúdo dinâmico, possibilita acessar de qualquer dispositivo\n\n## Timer e Música\n\n![Design Timer](https://i.imgur.com/ut0zxCI.png)\n\n## Lista de tarefas\n\n![Design Lista de Tarefas](https://i.imgur.com/jQ1mtzM.png)\n\n## Tecnologias utilizadas:\n\n* HTML\n* CSS\n* JavaScript\n## [Repositório do projeto](https://github.com/LuizEsb/Fokus)\n\n## Feito por:\n\n### LuizEsb\n\n### [Linkedin](https://www.linkedin.com/in/luizesb)" 
    },
    {
        "id": 7,
        "titulo": "VidFlow: plataforma de vídeos",
        "texto": "# VidFlow\n\nO VidFlow é uma plataforma de compartilhamento de vídeos. Projeto desenvolvido durante meus estudos com foco na manipulação de pacotes com Node. Interface e design previamente fornecida pela disponibilizadora do curso.\n\n![Captura de tela do Vidflow.](https://i.imgur.com/CS25zWT.png)\n\n## Confira a versão completa [aqui](https://vid-flow-beta.vercel.app/)\n\n## 🔨 Funcionalidades do projeto\n\nAtualmente, o visual do projeto e sua funcionalidade de buscar em uma API pelas informações dos vídeos já estão prontos.\n\nDurante o desenvolvimento do projeto apliquei novas ferramentas para melhorar a qualidade do código do projeto, como o ESLint, Prettier, Axios e o Vite.\n\nPara isso, aprendi a utilizar o **Node.js**, necessário para aplicar todas essas ferramentas.\n\n## ✔️ Técnicas e tecnologias utilizadas\n\n- Node.js\n- NPM\n- Os pacotes ESLint, Prettier, JSON Server, Axios e Vite\n- Vercel\n\n## Link do Figma\n\n[Acesse o Figma do Vidflow](https://www.figma.com/file/a0crwitCtGmNIQW0RVIs5H/VidFlow-%7C-Curso-Js---Consumindo-dados-de-uma-API?node-id=0%3A1&mode=dev).\n\n## 🛠️ Abrir e rodar o projeto\n## [Repositório do projeto](https://github.com/LuizEsb/VidFlow)\nApós baixar ou clonar o projeto deste repositório, você precisa ter o [Node.js](https://nodejs.org/) e o [`json-server`](https://www.npmjs.com/package/json-server) instalados.\n\nCaso não tenha o `json-server` instalado globalmente, execute o seguinte comando:\n\n```bash\nnpm install -g json-server@0.17.4\n```\n\nCom o Node.js e o `json-server` instalados, execute o seguinte comando para disponibilizar a API local de vídeos:\n\n```bash\njson-server --watch backend/videos.json\n```\n\nEm seguida, abra o `index.html` no navegador e o VidFlow já pode ser visualizado!\n\n## Feito por:\n\n### LuizEsb\n\n### [Linkedin](https://www.linkedin.com/in/luiz-felipe-esboldrim-9942a0345/)" 

    },
    {
        "id": 8,
        "titulo": "OptimusTech: website empresarial",
        "texto": "# OptimusTech\nEste projeto contém um website empresarial fictício \"OptimusTech\" desenvolvido por mim. O site ainda não possui responsividade pois foi desenvolvido no método desktop-first.\n\n### Confira o projeto completo [aqui](https://optimus-tech-umber-three.vercel.app/) \n\n## Página Inicial\n\n![Design da tela de clientes ERP-Delphi](https://i.imgur.com/iiqhNQp.png)\n\n## Rodapé \n\n![Design da tela de clientes ERP-Delphi](https://i.imgur.com/D55VGJV.png)\n\n### Ferramentas utilizadas:\n\n* HTML\n* CSS\n ## [Repositório do projeto](https://github.com/LuizEsb/optimus-tech)\n## Feito por:\n\n### LuizEsb\n\n### [Linkedin](https://www.linkedin.com/in/luiz-felipe-esboldrim-9942a0345/)"
    }
]